
sea='''
<div>
<title>东南亚</title>
<p>东南亚（SEA）位于亚洲东南部，包括中南半岛和马来群岛两大部分。东南亚地区共有11个国家：越南、老挝、柬埔寨、泰国、缅甸、马来西亚、新加坡、印度
尼西亚、文莱、菲律宾、东帝汶，面积约457万平方千米。在此，我们分析东南亚十个国家的旅游景点情况。</p>

<p>由上图可知：东南亚参观数最多的是泰国，其次是马来西亚，第三是越南，第四是印度尼西亚，第五是菲律宾，第六是柬埔寨，第七是缅甸，第八是老挝，第九是
文莱，最少的东帝汶。</p>
<p>景观数最多的依旧是泰国，其次是越南，第三是马来西亚，第四是印度尼西亚，第五是柬埔寨，第六是菲律宾，第七是缅甸，第八是老挝，第九
是文莱，最少的还是东帝汶。</p>
</div>
'''


each_sea={'philippines':'''
<div>
<title>菲律宾</title>
<p>菲律宾位于亚洲东南部。</p>
<p>北隔巴士海峡与中国台湾省遥遥相对，南和西南隔苏拉威西海、巴拉巴克海峡与印度尼西亚、马来西亚相望，西濒南中国海，东临太平洋。</p>

<p>以热力图表示来菲律宾的参观人数，颜色越深代表参观人数越多。</p>
<p>以地图形式展示菲律宾景点的位置，下面两张分别就是以条形图参观人数。</p>
<p>由高到低展示菲律宾的参观人数和景点数的具体概况，由图可得，参观人数最多得就是菲律宾的马尼拉，达到22822，其次为长滩岛，人数为17049，最少的是帕拉
纳克，仅有16人。</p>
<p>景点数最多的是加莱拉港，为20个，其次为干米银，为17个。</p>
</div>
''',


'cambodia':'''
<div>
<title>柬埔寨</title>
<p>柬埔寨位于中南半岛，占地181,035平方公里，20%为农业用地。西部及西北部与泰国接壤，东北部与老挝交界，东部及东南部与越南毗邻，南部则面向暹罗湾。</p>
<p>旅游资源丰富，曾经被环球旅行杂志评为全世界第一的旅行圣地。</p>

<p>以热力地图的形式展示柬埔寨的参观人数，颜色越深代表参观人数越多。</p>
<p>再以位置地图展示柬埔寨的各个景点位置，以条形图的形式展示柬埔寨参观人数由高到低排列。</p>
<p>参观人数最多的为波贝，为819，其次为贡布519，最少的为班龙，仅为18。</p>
<p>以条形图的形式展示柬埔寨景点数，景点数最多的是贡布，为14个。</p>
<p>其次为桔井，为6个。再以饼图形式展示柬埔寨类别情况，占比最大的就是美食，其次为景点观光。</p>
</div>
''',

'thailand':'''
<div>
<title>泰国</title>
<p>泰国位于亚洲中南半岛中南部，与柬埔寨、老挝、缅甸、马来西亚接壤。</p>
<p>泰国被称为度假天堂，景色非常优美。</p>
<p>连续多年进入全世界最受欢迎前三名的国家。 </p>
<p>泰国美食口味偏酸、甜、辣，各个岛上海鲜众多，物美价廉，无论是街边小摊还是海边大排档，都能够品尝到美味。</p>
<p>泰国是个佛教圣地，95%以上的人都信奉佛教，民风非常淳朴，泰国人民的友好给每个游客留下了深刻的印象。</p>
<p>泰国的物价非常便宜，而且作为一个旅游国度，各种旅游设施非常完善。特产丰富，例如泰国燕窝。</p>
<p>泰国珠宝，泰国独有的蛇药。独有的人妖文化。</p>

<p>以热力地图的形式展示泰国的参观人数，颜色越深代表参观人数越多。</p>
<p>再以位置地图展示泰国的各个景点位置，以条形图的形式展示泰国参观人数由高到低排列，参观人数最多的为春篷，为1766，其次为夜功，为1551，最少的为农磨和匹莱海滩，都仅为7。</p>
<p>以条形图的形式展示泰国景点数，景点数最多的是巴蜀府，一枝独秀，景点数达到567个，其次也就是北碧也就28个。</p>
<p>再以饼图形式展示泰国类别情况，占比最大的就是美食，其次为景点观光和休闲娱乐。</p>
</div>
''',

'brunei':'''
<div>
<title>文莱</title>
<p>文莱达鲁萨兰国位于加里曼丹岛北部，北濒南中国海，东南西三面与马来西亚的沙捞越州接壤，并被沙捞越州的林梦分隔为不相连的东西两部分，总面积为5765
平方公里。</p>
<p>文莱的旅游景点并不多，但处处显示着它的豪华与富有。</p>
<p>文莱是禁酒国家，在文莱是找不到卖酒的商店，游客只能携带275毫升酒入境自用。在文莱河上，层层叠叠地矗立着一排排人字形屋顶的高脚小木屋，组成了文莱最有特色的景观—水村。</p>

<p>以热力地图的形式展示文莱的参观人数，颜色越深代表参观人数越多。</p>
<p>再以位置地图展示文莱的各个景点位置。</p>
<p>以条形图的形式展示文莱参观人数由高到低排列，参观人数最多的为斯里巴家湾市，为1766，其次为白拉奕，为331，最少的为甘榜杰鲁登，都仅为124。</p>
<p>以条形图的形式展示泰国景点数，景点数最多的是斯里巴家湾市，景点数达到53个，其次也就是白拉奕也就3个。</p>
<P>再以饼图形式展示泰国类别情况，占比最大的就是美食，其次为景点观光和购物三足鼎立。</p>
</div>
''',

'vitetnam':'''
<div>
<title>越南</title>
<p>越南位于中南半岛东部，地理坐标为北纬8°10'～23°24'、东经102°09'～109°30'之间，北与中华人民共和国接壤，西与老挝人民民主共和国、柬埔寨王国交界，
东面和南面临南海。</p>
<p>越南女子的日常装扮是长裙、拖鞋与帽子。</p>
<p>越南是世界第二大稻米出口国，米粉是越南必吃的主食。</p>
<p>越南的四处都充斥着中国气息。摩托车在越南的普及程度就如同中国的自行车，那是家家必备、人人必用的交通工具。</p>

<p>以热力地图的形式展示越南的参观人数，颜色越深代表参观人数越多。</p>
<p>再以位置地图展示越南的各个景点位置。</p>
<p>以条形图的形式展示越南参观人数由高到低排列，参观人数最多的为海防市，为1809，其次为潘切，为331，最少的为甘榜杰鲁登，都仅为1676。</p>
<p>以条形图的形式展示越南景点数，景点数最多的是富国岛，景点数达到48个，其次也就是芹苴，为22个。</p>
<p>再以饼图形式展示泰国类别情况，占比最大的就是美食，其次为景点观光和购物。</p>
</div>
''',

'laos':'''
<div>
<title>老挝</title>
<p>老挝是一个位于中南半岛北部的内陆国家，北邻中国，南接柬埔寨，东临越南，西北毗邻缅甸，西南毗邻泰国。曾是法国殖民地，随处可见东西方文化的鲜明
冲撞。</p>
<p>东南亚冷门旅游地，看见的只有美景，没有人山人海。人与自然和谐相处，景观没有过分的商业化改造。 85%以上民众信奉佛教，拥有逛不完的古寺庙。
拥有世界文化古迹与古城，能够游览王国遗址。适合坐大巴游玩、适合穷游。</p>

<p>以热力地图的形式展示老挝的参观人数，颜色越深代表参观人数越多。</p>
<p>再以位置地图展示老挝的各个景点位置。</p>
<p>以条形图的形式展示老挝参观人数由高到低排列，参观人数最多的为琅勃拉邦，为7899，其次为万象，为6580，最少的桑怒，仅为2。以条形图的形式展示老挝景点数，景点数最多的是万象，景点数达到92个，其次也就是琅勃拉邦，为68个。</p>
<p>再以饼图形式展示泰国类别情况，占比最大的就是景点观光，其次为美食。</p>
</div>
''',

'malaysia':'''
<div>
<title>马来西亚</title>
<p>马来西亚国土面积330345平方公里，位于太平洋和印度洋之间，北与泰国接壤，西濒马六甲海峡，东临南中国海，南濒柔佛海峡与新加坡毗邻。</p>
<p>马来西亚位赤道附近，属于热带雨林气候和热带季风气候，无明显四季之分。</p >

<p>以热力图表示来马来西亚的参观人数，颜色越亮代表参观人数越多。</p>
<p>以地图形式展示马来西亚景点的位置。</p>
<p>下面两张分别是以柱状图由高到低展示马来西亚的参观人数和景点数的具体概况，由图可得，马来西亚参观人数最多的地区是吉隆坡，达到108220，其次为马六甲，人数为33007，最少的是马廖盆地，仅有1人。</p>
<p>景点数最多的是吉隆坡，为1500个，其次为马六甲，为578个。</p>
<p>再以饼图形式展示马来西亚旅游类别，占比最大的是美食，其次是景点观光和休闲娱乐。</p>
</div>
''',

'myanmar':'''
<div>
<title>缅甸</title>
<p>缅甸位于亚洲东南部、中南半岛西部，面积约67.85万平方公里，其北部和东北部同中国西藏和云南接界，东部与老挝和泰国毗邻，西部与印度
、孟加拉国接壤。</p >

<p>以热力图表示来缅甸的参观人数，颜色越亮代表参观人数越多。</p >
<p>以地图形式展示缅甸景点的位置。</p >
<p>下面两张分别是以柱状图由高到低展示缅甸的参观人数和景点数的具体概况，由图可得，缅甸参观人数最多的地区是仰光，达到7877，其次为蒲甘，人数为6904，最少的是新平洋，仅有1人。</p >
<p>景点数最多的是仰光，为109个，其次为蒲甘，为97个。</p >
<p>再以饼图形式展示缅甸旅游类别，占比最大的是景点观光，其次是美食和购物。</p >
</div>
''',

'east-timor':'''
<div>
<title>东帝汶</title>
<p>东帝汶位于东南亚努沙登加拉群岛最东端，岛国。包括帝汶岛东部和西部北海岸的欧库西地区以及附近的阿陶罗岛和东端的雅库岛。西部与印尼
西帝汶相接，南隔帝汶海与澳大利亚相望。国土面积14919平方公里。</p >

<p>以热力图表示来东帝汶的参观人数，颜色越亮代表参观人数越多。</p >
<p>以地图形式展示东帝汶景点的位置。</p >
<p>下面两张分别是以柱状图由高到低展示东帝汶的参观人数和景点数的具体概况，由图可得，东帝汶参观人数最多的地区是帝力，为146，其次为包考，人数为31；景点数最多的帝力，为5个。</p >
<p>再以饼图形式展示东帝汶旅游类别，景点观光占了所有比例。</p >
</div>
''',

'indonesia':'''
<div>
<title>印度尼西亚</title>
<p>印度尼西亚位于亚洲东南部，地跨赤道，与巴布亚新几内亚、东帝汶、马来西亚接壤，与泰国、新加坡、菲律宾、澳大利亚等国隔海相望。
印度尼西亚是典型的热带雨林气候，年平均温度25-27℃，无四季分别。</p >

<p>以热力图表示来印度尼西亚的参观人数，颜色越亮代表参观人数越多。</p >
<p>以地图形式展示印度尼西亚景点的位置，下面两张分别是以柱状图由高到低展示印度尼西亚的参观人数和景点数的具体概况，由图可得，印度尼西亚参观人数最多的地区是巴厘岛，达到44372，其次为库塔，人数为17653，最少的是博拉科特，
仅有1人。</p >
<p>景点数最多的是巴厘岛，为1500个，其次为库塔，为502个。</p >
<p>再以饼图形式展示印度尼西亚旅游类别，占比最大的是美食，其次是景点观光和休闲娱乐。</p >
</div>
'''
}
